x, y = [int(input()) for _ in range(2)]
z = input()

if z == '+':
    print(x+y)
elif z == '-':
    print(x-y)
elif z == '*':
    print(x*y)
elif z == '/':
    if y == 0:
        print('На ноль делить нельзя!')
    else:
        print(x/y)
else:
    print('Неверная операция')


"""

1	6104
0
/	На ноль делить нельзя!
2	25
5
*	125
3	89
80
-	9
4	567
433
+	1000
5	60
3
/	20.0
6	690430976
0
*	0
7	676865
-87778
+	589087
8	-987
-5
-	-982
9	6
990
python3	Неверная операция
10	241
88
241	Неверная операция
11	0
0
/	На ноль делить нельзя!
12	0
17
/	0.0

"""