#Напишите программу, которая выводит прямоугольник, по периметру состоящий из звездочек (*).
#Высота и ширина прямоугольника равны 44 и 1717 звёздочкам соответственно.

print("*"*17)
print("*"," "*(17-4),"*")#,"\n")
print("*"," "*(17-4),"*")#,"\n")
print("*"*17)


