# Напишите программу, которая определяет наименьшее из четырёх чисел.

"""num1 = int(input())
num2 = int(input())
num3 = int(input())
num4 = int(input())"""

f = [int(input()),int(input()),int(input()),int(input())]
    
#for i in range(4):
print(min(f))