# Напишите программу, которая считывает два целых числа aa и bb и выводит на экран квадрат суммы и сумму квадратов a^2+b^2a 
a = int(input())
b = int(input())

print("Квадрат суммы", a, "и", b, "равен", (a+b)**2)
print("Сумма квадратов", a, "и", b, "равна", (a**2)+(b**2))


