a1 = input()
a2 = input()

if a1 == 'красный':
    if a2 == 'красный':
        print('красный')
    elif a2 == 'желтый':
        print('оранжевый')
    elif a2 == 'синий':
        print('фиолетовый')
elif a1 == 'желтый':
    if a2 == 'красный':
        print('оранжевый')
    elif a2 == 'желтый':
        print('желтый')
    elif a2 == 'синий':
        print('зеленый')
elif a1 == 'синий':
    if a2 == 'красный':
        print('фиолетовый')
    elif a2 == 'желтый':
        print('зеленый')
    elif a2 == 'синий':
        print('синий')
if a1 not in ('синий', 'красный', 'желтый') or a2 not in ('синий', 'красный', 'желтый'):
    print('ошибка цвета')